{
    "format": "layers-model",
    "generatedBy": "TensorFlow.js v3.18.0",
    "convertedBy": null,
    "modelTopology": {
        "class_name": "Sequential",
        "config": {
            "name": "sequential",
            "layers": [
                {
                    "class_name": "Conv2D",
                    "config": {
                        "filters": 32,
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "name": "conv2d",
                        "trainable": true,
                        "batch_input_shape": [
                            null,
                            28,
                            28,
                            1
                        ],
                        "dtype": "float32"
                    }
                },
                {
                    "class_name": "MaxPooling2D",
                    "config": {
                        "pool_size": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "strides": [
                            2,
                            2
                        ],
                        "data_format": "channels_last",
                        "name": "max_pooling2d",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Conv2D",
                    "config": {
                        "filters": 64,
                        "kernel_size": [
                            3,
                            3
                        ],
                        "strides": [
                            1,
                            1
                        ],
                        "padding": "valid",
                        "data_format": "channels_last",
                        "dilation_rate": [
                            1,
                            1
                        ],
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "name": "conv2d_1",
                        "trainable": true
                    }
                },
                {
                    "class_name": "MaxPooling2D",
                    "config": {
                        "pool_size": [
                            2,
                            2
                        ],
                        "padding": "valid",
                        "strides": [
                            2,
                            2
                        ],
                        "data_format": "channels_last",
                        "name": "max_pooling2d_1",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten",
                        "trainable": true,
                        "data_format": "channels_last"
                    }
                },
                {
                    "class_name": "Dropout",
                    "config": {
                        "rate": 0.5,
                        "noise_shape": null,
                        "seed": null,
                        "name": "dropout",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "units": 128,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "name": "dense",
                        "trainable": true
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "units": 10,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "name": "dense_1",
                        "trainable": true
                    }
                }
            ]
        },
        "keras_version": "2.8.0",
        "backend": "tensorflow"
    },
    "weightsManifest": [
        {
            "paths": [
                "weights.bin"
            ],
            "weights": [
                {
                    "name": "conv2d/kernel",
                    "shape": [
                        3,
                        3,
                        1,
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d/bias",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_1/kernel",
                    "shape": [
                        3,
                        3,
                        32,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_1/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/kernel",
                    "shape": [
                        1600,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/bias",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/kernel",
                    "shape": [
                        128,
                        10
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/bias",
                    "shape": [
                        10
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}